---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightShape.Clone
source: html/189b18d1-2efc-49f7-da12-a157c6a745b6.htm
---
# Autodesk.Revit.DB.Lighting.LightShape.Clone Method

Creates a copy of the LightShape derived object.

## Syntax (C#)
```csharp
public LightShape Clone()
```